/**
 * related html: blog/index.html
 */

$(function () {

    // #1 变量定义区~
    //==================================================================================================================
    // #2 函数定义区~
    //==================================================================================================================

    // 自定义操作内容
    function customBlogPopover() {
        return '<a class="text-dark" href="#">评论</a><br/>'
            + '<a class="text-dark" href="#">举报</a><br>';
    }

    // #3 脚本初始化~
    //==================================================================================================================

    //   initialize all popovers
    $('[data-toggle="popover"]').each(function () {
        const element = $(this);
        element.popover({
            trigger: 'click hover focus',
            placement: 'bottom',
            html: true,
            content: customBlogPopover()
        });
    });

    // #4 事件定义区~
    //==================================================================================================================

});
