/**
 * related html: blog/index.html
 */

$(function () {

    // #1 变量定义区~
    //==================================================================================================================

    const PAGE_SIZE = 5;

    // #2 函数定义区~
    //==================================================================================================================

    // 重定向页面
    function loadPage(page) {
        const sort = $('#blogSort').val();
        const keyword = $('#blogKeyword').val();
        window.location = "/blog/more?page=" + page + "&size=" + PAGE_SIZE + "&sort=" + sort + "&keyword=" + keyword;
    }

    // #3 脚本初始化~
    //==================================================================================================================

    // #4 事件定义区~
    //==================================================================================================================

    // 分页点击事件
    $('.pagination').on('click', '.page-item', function () {
        if (!$(this).hasClass('disabled')) {
            const page = $(this).children('.page-link').text();
            loadPage(page);
        }
    });
});
